source/.NET Standard/Unimake.Business.DFe/Servicos/Config/eSocial/AN.xml

<?xml version="1.0" encoding="utf-8" ?>
<Configuracoes>
	<Servicos ID="ESocial">
		<EnviarLoteEventosESocial versao="1.1.0">
			<Descricao>Enviar Lote Eventos eSocial</Descricao>
			<WebEnderecoProducao>https://webservices.envio.esocial.gov.br/servicos/empregador/enviarloteeventos/WsEnviarLoteEventos.svc?wsdl</WebEnderecoProducao>
			<WebEnderecoHomologacao>https://webservices.producaorestrita.esocial.gov.br/servicos/empregador/enviarloteeventos/WsEnviarLoteEventos.svc?wsdl</WebEnderecoHomologacao>
			<WebActionProducao>http://www.esocial.gov.br/servicos/empregador/lote/eventos/envio/v1_1_0/ServicoEnviarLoteEventos/EnviarLoteEventos</WebActionProducao>
			<WebActionHomologacao>http://www.esocial.gov.br/servicos/empregador/lote/eventos/envio/v1_1_0/ServicoEnviarLoteEventos/EnviarLoteEventos</WebActionHomologacao>
			<WebContentType>text/xml</WebContentType>
			<WebTagRetorno>EnviarLoteEventosResult</WebTagRetorno>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><EnviarLoteEventos xmlns="http://www.esocial.gov.br/servicos/empregador/lote/eventos/envio/v1_1_0"><loteEventos>{xmlBody}</loteEventos></EnviarLoteEventos></soap:Body></soap:Envelope>]]></WebSoapString>
			<TargetNS>http://www.esocial.gov.br/schema/lote/eventos/envio/v1_1_1</TargetNS>
		</EnviarLoteEventosESocial>
	</Servicos>
</Configuracoes>
